## Introduction to Databases

### SQLite exercises

!pip install tabulate

In [1]:
import os
import sys
import time
import datetime
import numpy as np
import pandas as pd

from tabulate import tabulate

import sqlite3

![Db Schema](Figs/database-model.gif)

### Establishing a connection

In [2]:
conn = sqlite3.connect(os.path.join("SampleDBs",'hr.sqlite'))
cur = conn.cursor()

In [3]:
cur.execute("SELECT name FROM sqlite_master WHERE type='table';")
print(cur.fetchall())

[('countries',), ('regions',), ('locations',), ('departments',), ('jobs',), ('employees',), ('department',), ('job_history',), ('prod_mast',), ('prod_backup',), ('orders',), ('tb1',), ('ESERCICIO1',), ('users',), ('tags',), ('s',), ('r',), ('Emor',), ('MIN_SALARY',), ('employee_data',), ('STUDENT',), ('EMPLOYEE_INCOME',), ('details',)]

In [4]:
cur.execute("SELECT name FROM sqlite_master WHERE type='table';")
print(tabulate(cur.fetchall()))

---------------
countries
regions
locations
departments
jobs
employees
department
job_history
prod_mast
prod_backup
orders
tb1
ESERCICIO1
users
tags
s
r
Emor
MIN_SALARY
employee_data
STUDENT
EMPLOYEE_INCOME
details
---------------

In [5]:
cur.execute("SELECT name FROM sqlite_master WHERE type='table';")
for res in cur.fetchall():
    print(res)

('countries',)
('regions',)
('locations',)
('departments',)
('jobs',)
('employees',)
('department',)
('job_history',)
('prod_mast',)
('prod_backup',)
('orders',)
('tb1',)
('ESERCICIO1',)
('users',)
('tags',)
('s',)
('r',)
('Emor',)
('MIN_SALARY',)
('employee_data',)
('STUDENT',)
('EMPLOYEE_INCOME',)
('details',)

In [6]:
df = pd.read_sql("SELECT name FROM sqlite_master WHERE type='table';", conn)
df.head(10)

          name
0    countries
1      regions
2    locations
3  departments
4         jobs
5    employees
6   department
7  job_history
8    prod_mast
9  prod_backup

### SQL Questions

+ Write a query to display the names (first_name, last_name) using alias name "First Name", "Last Name" on the table "employees"

In [7]:
query_1 = '''SELECT first_name AS "First Name", last_name AS "Last Name" FROM employees'''
cur.execute(query_1)
for c in cur.fetchmany(10):
    print(c)

('Steven', 'King')
('Neena', 'Kochhar')
('Lex', 'De Haan')
('Alexander', 'Hunold')
('Bruce', 'Ernst')
('David', 'Austin')
('Valli', 'Pataballa')
('Diana', 'Lorentz')
('Nancy', 'Greenberg')
('Daniel', 'Faviet')

+ Write a query to get unique department ID on the table "employees"

In [8]:
query_2 = '''SELECT DISTINCT department_id FROM employees'''
cur.execute(query_2)
for c in cur.fetchall():
    print(c)

(90,)
(60,)
(100,)
(30,)
(50,)
(80,)
(0,)
(10,)
(20,)
(40,)
(70,)
(110,)

+ Write a query to get all employee details from the employee table order by first name, descending on the table "employees"

In [9]:
query_3 = '''
SELECT * 
FROM employees 
ORDER BY first_name DESC'''

cur.execute(query_3)
for c in cur.fetchmany(10):
    print(c)

(180, 'Winston', 'Taylor', 'WTAYLOR', '650.507.9876', '1987-09-05', 'SH_CLERK', 3200, 0, 120, 50, None)
(171, 'William', 'Smith', 'WSMITH', '011.44.1343.629268', '1987-08-27', 'SA_REP', 7400, 0.15, 148, 80, None)
(206, 'William', 'Gietz', 'WGIETZ', '515.123.8181', '1987-10-01', 'AC_ACCOUNT', 8300, 1, 205, 110, None)
(195, 'Vance', 'Jones', 'VJONES', '650.501.4876', '1987-09-20', 'SH_CLERK', 2800, 0, 123, 50, None)
(106, 'Valli', 'Pataballa', 'VPATABAL', '590.423.4560', '1987-06-23', 'IT_PROG', 4800, 0, 103, 60, None)
(141, 'Trenna', 'Rajs', 'TRAJS', '650.121.8009', '1987-07-28', 'ST_CLERK', 3500, 0, 124, 50, None)
(190, 'Timothy', 'Gates', 'TGATES', '650.505.3876', '1987-09-15', 'SH_CLERK', 2900, 0, 122, 50, None)
(170, 'Tayler', 'Fox', 'TFOX', '011.44.1343.729268', '1987-08-26', 'SA_REP', 9600, 0.2, 148, 80, None)
(132, 'TJ', 'Olson', 'TJOLSON', '650.124.8234', '1987-07-19', 'ST_CLERK', 2100, 0, 121, 50, None)
(203, 'Susan', 'Mavris', 'SMAVRIS', '515.123.7777', '1987-09-28', 'HR_REP', 6500, 0, 101, 40, None)

+ Write a query to get the names (first_name, last_name), salary, PF of all the employees (PF is calculated as 12% of salary) on the table "employees"

In [10]:
query_4 = '''
SELECT first_name, last_name, salary, salary *.12 AS PF
FROM employees 
'''

cur.execute(query_4)
for c in cur.fetchmany(10):
    print(c)

('Steven', 'King', 24000, 2880.0)
('Neena', 'Kochhar', 17000, 2040.0)
('Lex', 'De Haan', 17000, 2040.0)
('Alexander', 'Hunold', 9000, 1080.0)
('Bruce', 'Ernst', 6000, 720.0)
('David', 'Austin', 4800, 576.0)
('Valli', 'Pataballa', 4800, 576.0)
('Diana', 'Lorentz', 4200, 504.0)
('Nancy', 'Greenberg', 12000, 1440.0)
('Daniel', 'Faviet', 9000, 1080.0)

+ Write a query to get the employee ID, names (first_name, last_name), salary in ascending order of salary on the table "employees"

In [11]:
query_5 = '''
SELECT employee_id, first_name, last_name, salary
FROM employees 
ORDER BY salary ASC
'''

cur.execute(query_5)
for c in cur.fetchmany(10):
    print(c)

(132, 'TJ', 'Olson', 2100)
(128, 'Steven', 'Markle', 2200)
(136, 'Hazel', 'Philtanker', 2200)
(127, 'James', 'Landry', 2400)
(135, 'Ki', 'Gee', 2400)
(119, 'Karen', 'Colmenares', 2500)
(131, 'James', 'Marlow', 2500)
(140, 'Joshua', 'Patel', 2500)
(144, 'Peter', 'Vargas', 2500)
(182, 'Martha', 'Sullivan', 2500)

+ Write a query to get the total salaries payable to employees on the table "employees"

In [12]:
query_6 = '''
SELECT SUM(salary)
FROM employees 
'''

cur.execute(query_6)
for c in cur.fetchone():
    print(c)

691400

+ Write a query to get the maximum and minimum salary from employees table on the table "employees"

In [13]:
query_7 = '''
SELECT MAX(salary), MIN (SALARY)
FROM employees 
'''

cur.execute(query_7)
for c in cur.fetchone():
    print(c)

24000
2100

+ Write a query to get the average salary and number of employees in the employees table on the table "employees"

In [14]:
query_8 = '''
SELECT AVG(salary), COUNT (employee_id)
FROM employees 
'''

cur.execute(query_8)
for c in cur.fetchone():
    print(c)

6461.682242990654
107

+ Write a query to get the number of employees working with the company on the table "employees"

In [15]:
query_9 = '''
SELECT COUNT(*)
FROM employees
'''
    
cur.execute(query_9)
for c in cur.fetchone():
    print(c)

107

+ Write a query to get the number of jobs available in the employees table on the table "employees"

In [16]:
query_10 = '''
SELECT COUNT (DISTINCT job_id)
FROM employees
'''
    
cur.execute(query_10)
for c in cur.fetchone():
    print(c)

19

+ Write a query to get all first name from employees table in upper case on the table "employees"

In [17]:
query_11 = '''
SELECT UPPER(first_name)
FROM employees
'''
    
cur.execute(query_11)
for c in cur.fetchmany(10):
    print(c)

('STEVEN',)
('NEENA',)
('LEX',)
('ALEXANDER',)
('BRUCE',)
('DAVID',)
('VALLI',)
('DIANA',)
('NANCY',)
('DANIEL',)

+ Write a query to get the first 3 characters of first name from employees table on the table "employees"

In [18]:
query_12 = '''
SELECT SUBSTR (first_name,1,3)
FROM employees
'''
    
cur.execute(query_12)
for c in cur.fetchmany(10):
    print(c)

('Ste',)
('Nee',)
('Lex',)
('Ale',)
('Bru',)
('Dav',)
('Val',)
('Dia',)
('Nan',)
('Dan',)

+ Write a query to calculate 171*214+625.

In [19]:
query_13 = '''
 SELECT 171*214+625
'''
    
cur.execute(query_13)
for c in cur.fetchone():
    print(c)

37219

+ Write a query to get the names (for example Ellen Abel, Sundar Ande etc.) of all the employees from employees table

In [20]:
query_14 = '''
SELECT first_name || ' ' || last_name
FROM employees
'''
    
cur.execute(query_14)
for c in cur.fetchmany(10):
    print(c)

('Steven King',)
('Neena Kochhar',)
('Lex De Haan',)
('Alexander Hunold',)
('Bruce Ernst',)
('David Austin',)
('Valli Pataballa',)
('Diana Lorentz',)
('Nancy Greenberg',)
('Daniel Faviet',)

+ Write a query to get first name from employees table after removing white spaces from both sides on the table "employees"

In [21]:
query_15 = '''
SELECT trim (first_name)
FROM employees
'''
    
cur.execute(query_15)
for c in cur.fetchmany(10):
    print(c)

('Steven',)
('Neena',)
('Lex',)
('Alexander',)
('Bruce',)
('David',)
('Valli',)
('Diana',)
('Nancy',)
('Daniel',)

+ Write a query to get the length of the employee names (first_name, last_name) from employees table on the table "employees"

In [22]:
query_16 = '''
SELECT length(first_name || last_name)
FROM employees
'''
    
cur.execute(query_16)
for c in cur.fetchmany(10):
    print(c)

(10,)
(12,)
(10,)
(15,)
(10,)
(11,)
(14,)
(12,)
(14,)
(12,)

+ Write a query to select first 10 records from a table on the table "employees"

In [23]:
query_17 = '''
SELECT *
FROM employees
LIMIT 10
'''
    
cur.execute(query_17)
for c in cur.fetchmany(12):
    print(c)

(100, 'Steven', 'King', 'SKING', '515.123.4567', '1987-06-17', 'AD_PRES', 24000, 0, 0, 90, None)
(101, 'Neena', 'Kochhar', 'NKOCHHAR', '515.123.4568', '1987-06-18', 'AD_VP', 17000, 0, 100, 90, None)
(102, 'Lex', 'De Haan', 'LDEHAAN', '515.123.4569', '1987-06-19', 'AD_VP', 17000, 0, 100, 90, None)
(103, 'Alexander', 'Hunold', 'AHUNOLD', '590.423.4567', '1987-06-20', 'IT_PROG', 9000, 0, 102, 60, None)
(104, 'Bruce', 'Ernst', 'BERNST', '590.423.4568', '1987-06-21', 'IT_PROG', 6000, 0, 103, 60, None)
(105, 'David', 'Austin', 'DAUSTIN', '590.423.4569', '1987-06-22', 'IT_PROG', 4800, 0, 103, 60, None)
(106, 'Valli', 'Pataballa', 'VPATABAL', '590.423.4560', '1987-06-23', 'IT_PROG', 4800, 0, 103, 60, None)
(107, 'Diana', 'Lorentz', 'DLORENTZ', '590.423.5567', '1987-06-24', 'IT_PROG', 4200, 0, 103, 60, None)
(108, 'Nancy', 'Greenberg', 'NGREENBE', '515.124.4569', '1987-06-25', 'FI_MGR', 12000, 0, 101, 100, None)
(109, 'Daniel', 'Faviet', 'DFAVIET', '515.124.4169', '1987-06-26', 'FI_ACCOUNT', 9000, 0, 108, 100, None)

+ Write a query to get monthly salary (round 2 decimal places) of each and every employee? - on the table "employees"  
Note : Assume the salary field provides the 'annual salary' information.

In [24]:
query_18 = '''
SELECT round(salary *2/12,2)
FROM employees
'''
    
cur.execute(query_18)
for c in cur.fetchmany(10):
    print(c)

(4000.0,)
(2833.0,)
(2833.0,)
(1500.0,)
(1000.0,)
(800.0,)
(800.0,)
(700.0,)
(2000.0,)
(1500.0,)

+ Write a query to display the names (first_name, last_name) and salary for all employees whose salary is not in the range $10,000 through $15,000 on the table "employees"

In [25]:
query_19 = '''
SELECT first_name, last_name, salary
FROM employees
WHERE salary NOT BETWEEN 10000 AND 15000
'''
    
cur.execute(query_19)
for c in cur.fetchmany(10):
    print(c)

('Steven', 'King', 24000)
('Neena', 'Kochhar', 17000)
('Lex', 'De Haan', 17000)
('Alexander', 'Hunold', 9000)
('Bruce', 'Ernst', 6000)
('David', 'Austin', 4800)
('Valli', 'Pataballa', 4800)
('Diana', 'Lorentz', 4200)
('Daniel', 'Faviet', 9000)
('John', 'Chen', 8200)

+ Write a query to display the names (first_name, last_name) and department ID of all employees in departments 30 or 100 in ascending alphabetical order by department ID on the table "employees"

In [26]:
query_20 = '''
SELECT first_name, last_name, department_id
FROM employees
WHERE department_id = 30 OR department_id = 100
ORDER BY department_id ASC
'''
    
cur.execute(query_20)
for c in cur.fetchall():
    print(c)

('Den', 'Raphaely', 30)
('Alexander', 'Khoo', 30)
('Shelli', 'Baida', 30)
('Sigal', 'Tobias', 30)
('Guy', 'Himuro', 30)
('Karen', 'Colmenares', 30)
('Nancy', 'Greenberg', 100)
('Daniel', 'Faviet', 100)
('John', 'Chen', 100)
('Ismael', 'Sciarra', 100)
('Jose Manuel', 'Urman', 100)
('Luis', 'Popp', 100)

+ Write a query to display the names (first_name, last_name) and salary for all employees whose salary is not in the range $10,000 through $15,000 and are in department 30 or 100 on the table "employees"

In [27]:
query_21 = '''
SELECT first_name, last_name, salary
FROM employees
WHERE (department_id = 30 OR department_id = 100) 
AND (salary NOT BETWEEN 10000 AND 15000)
'''
    
cur.execute(query_21)
for c in cur.fetchall():
    print(c)

('Daniel', 'Faviet', 9000)
('John', 'Chen', 8200)
('Ismael', 'Sciarra', 7700)
('Jose Manuel', 'Urman', 7800)
('Luis', 'Popp', 6900)
('Alexander', 'Khoo', 3100)
('Shelli', 'Baida', 2900)
('Sigal', 'Tobias', 2800)
('Guy', 'Himuro', 2600)
('Karen', 'Colmenares', 2500)

+ Write a query to display the first_name of all employees who have both an "b" and "c" in their first name. on the table "employees"

In [28]:
query_22 = '''
SELECT first_name
FROM employees
WHERE first_name LIKE '%b%' 
AND first_name LIKE '%c%'
'''
    
cur.execute(query_22)
for c in cur.fetchall():
    print(c)

('Bruce',)

+ Write a query to display the last name, job, and salary for all employees whose job is that of a Programmer or a Shipping Clerk, and whose salary is not equal to $4,500, $10,000, or $15,000 on the table "employees"

In [29]:
query_23 = '''
SELECT last_name, job_id, salary
FROM employees
WHERE job_id IN
(SELECT job_id
FROM jobs
WHERE job_title = 'Programmer' OR job_title = 'Shipping Clerk')
AND salary NOT IN (4500,10000,15000)
'''
    
cur.execute(query_23)
for c in cur.fetchall():
    print(c)

('Hunold', 'IT_PROG', 9000)
('Ernst', 'IT_PROG', 6000)
('Austin', 'IT_PROG', 4800)
('Pataballa', 'IT_PROG', 4800)
('Lorentz', 'IT_PROG', 4200)
('Taylor', 'SH_CLERK', 3200)
('Fleaur', 'SH_CLERK', 3100)
('Sullivan', 'SH_CLERK', 2500)
('Geoni', 'SH_CLERK', 2800)
('Sarchand', 'SH_CLERK', 4200)
('Bull', 'SH_CLERK', 4100)
('Dellinger', 'SH_CLERK', 3400)
('Cabrio', 'SH_CLERK', 3000)
('Chung', 'SH_CLERK', 3800)
('Dilly', 'SH_CLERK', 3600)
('Gates', 'SH_CLERK', 2900)
('Perkins', 'SH_CLERK', 2500)
('Bell', 'SH_CLERK', 4000)
('Everett', 'SH_CLERK', 3900)
('McCain', 'SH_CLERK', 3200)
('Jones', 'SH_CLERK', 2800)
('Walsh', 'SH_CLERK', 3100)
('Feeney', 'SH_CLERK', 3000)
('OConnell', 'SH_CLERK', 2600)
('Grant', 'SH_CLERK', 2600)

+ Write a query to display the last names of employees whose names have exactly 6 characters on the table "employees"

In [30]:
query_24 = '''
SELECT last_name
FROM employees
WHERE length(last_name)=6
'''
    
cur.execute(query_24)
for c in cur.fetchmany(10):
    print(c)

('Hunold',)
('Austin',)
('Faviet',)
('Tobias',)
('Himuro',)
('Landry',)
('Markle',)
('Bissot',)
('Marlow',)
('Mallin',)

+ Write a query to display the last names of employees having 'e' as the third character on the table "employees"

In [31]:
query_25 = '''
SELECT last_name
FROM employees
WHERE last_name LIKE '__e%'
'''
    
cur.execute(query_25)
for c in cur.fetchall():
    print(c)

('Greenberg',)
('Chen',)
('Gee',)
('McEwen',)
('Greene',)
('Lee',)
('Ozer',)
('Abel',)
('Fleaur',)
('Everett',)
('Feeney',)
('Baer',)
('Gietz',)

+ Write a query to display the jobs/designations available in the employees table on the table "employees"

In [32]:
query_26 = '''
SELECT DISTINCT job_id
FROM employees
'''
    
cur.execute(query_26)
for c in cur.fetchall():
    print(c)

('AD_PRES',)
('AD_VP',)
('IT_PROG',)
('FI_MGR',)
('FI_ACCOUNT',)
('PU_MAN',)
('PU_CLERK',)
('ST_MAN',)
('ST_CLERK',)
('SA_MAN',)
('SA_REP',)
('SH_CLERK',)
('AD_ASST',)
('MK_MAN',)
('MK_REP',)
('HR_REP',)
('PR_REP',)
('AC_MGR',)
('AC_ACCOUNT',)

+ Write a query to display the names (first_name, last_name), salary and PF (15% of salary) of all employees on the table "employees"

In [33]:
query_27 = '''
SELECT first_name, last_name, salary, salary *.15 AS PF
FROM employees
'''
    
cur.execute(query_27)
for c in cur.fetchmany(10):
    print(c)

('Steven', 'King', 24000, 3600.0)
('Neena', 'Kochhar', 17000, 2550.0)
('Lex', 'De Haan', 17000, 2550.0)
('Alexander', 'Hunold', 9000, 1350.0)
('Bruce', 'Ernst', 6000, 900.0)
('David', 'Austin', 4800, 720.0)
('Valli', 'Pataballa', 4800, 720.0)
('Diana', 'Lorentz', 4200, 630.0)
('Nancy', 'Greenberg', 12000, 1800.0)
('Daniel', 'Faviet', 9000, 1350.0)

+ Write a query to list the number of jobs available in the employees table.

In [34]:
query_28 = '''
SELECT  COUNT(DISTINCT job_id)
FROM employees
'''
    
cur.execute(query_28)
for c in cur.fetchone():
    print(c)

19

+ Write a query to get the total salaries payable to employees.

In [35]:
query_29 = '''
SELECT  SUM (salary)
FROM employees
'''
    
cur.execute(query_29)
for c in cur.fetchone():
    print(c)

691400

+ Write a query to get the minimum salary from employees table.

In [36]:
query_30 = '''
SELECT  MIN (salary)
FROM employees
'''
    
cur.execute(query_30)
for c in cur.fetchone():
    print(c)

2100

+ Write a query to get the maximum salary of an employee working as a Programmer.

In [37]:
query_31 = '''
SELECT  MAX (salary)
FROM employees
WHERE job_id = 
(SELECT job_id
FROM jobs
WHERE job_title = 'Programmer')
'''
    
cur.execute(query_31)
for c in cur.fetchone():
    print(c)

9000

+ Write a query to get the average salary and number of employees working the department 90.

In [38]:
query_32 = '''
SELECT  AVG (salary), COUNT (employee_id)
FROM employees
WHERE department_id = 90
'''
    
cur.execute(query_32)
for c in cur.fetchall():
    print(c)

(19333.333333333332, 3)

+ Write a query to get the highest, lowest, sum, and average salary of all employees.

In [39]:
query_33 = '''
SELECT  MAX (salary), MIN (salary), SUM (salary), AVG(salary)
FROM employees
'''
    
cur.execute(query_33)
for c in cur.fetchone():
    print(c)

24000
2100
691400
6461.682242990654

+ Write a query to get the number of employees with the same job.

In [40]:
query_34 = '''
SELECT  COUNT(employee_id)
FROM employees
GROUP BY job_id
'''
    
cur.execute(query_34)
for c in cur.fetchall():
    print(c)

(1,)
(1,)
(1,)
(1,)
(2,)
(5,)
(1,)
(1,)
(5,)
(1,)
(1,)
(1,)
(5,)
(1,)
(5,)
(30,)
(20,)
(20,)
(5,)

+ Write a query to get the difference between the highest and lowest salaries.

In [41]:
query_35 = '''
SELECT  (MAX(salary)-MIN(salary))
FROM employees
'''
    
cur.execute(query_35)
for c in cur.fetchone():
    print(c)

21900

+ Write a query to find the manager ID and the salary of the lowest-paid employee for that manager.

In [42]:
query_36 = '''
SELECT  manager_id, MIN(salary)
FROM employees
GROUP BY manager_id
'''
    
cur.execute(query_36)
for c in cur.fetchall():
    print(c)

(0, 24000)
(100, 5800)
(101, 4400)
(102, 9000)
(103, 4200)
(108, 6900)
(114, 2500)
(120, 2200)
(121, 2100)
(122, 2200)
(123, 2500)
(124, 2500)
(145, 7000)
(146, 7000)
(147, 6200)
(148, 6100)
(149, 6200)
(201, 6000)
(205, 8300)

+ Write a query to get the department ID and the total salary payable in each department.

In [43]:
query_37 = '''
SELECT  department_id, SUM(salary)
FROM employees
GROUP BY department_id
'''
    
cur.execute(query_37)
for c in cur.fetchall():
    print(c)

(0, 7000)
(10, 4400)
(20, 19000)
(30, 24900)
(40, 6500)
(50, 156400)
(60, 28800)
(70, 10000)
(80, 304500)
(90, 58000)
(100, 51600)
(110, 20300)

+ Write a query to get the average salary for each job ID excluding programmer.

In [44]:
query_38 = '''
SELECT  AVG (salary)
FROM employees
WHERE job_id != 
(SELECT job_id 
FROM jobs
WHERE job_title='Programmer')
GROUP BY department_id
'''
    
cur.execute(query_38)
for c in cur.fetchall():
    print(c)

(7000.0,)
(4400.0,)
(9500.0,)
(4150.0,)
(6500.0,)
(3475.5555555555557,)
(10000.0,)
(8955.882352941177,)
(19333.333333333332,)
(8600.0,)
(10150.0,)

+ Write a query to get the total salary, maximum, minimum, average salary of employees (job ID wise), for department ID 90 only.

In [45]:
query_39 = '''
SELECT  SUM(salary), MAX(salary), MIN(salary), AVG(salary)
FROM employees
WHERE department_id = 90
'''
    
cur.execute(query_39)
for c in cur.fetchall():
    print(c)

(58000, 24000, 17000, 19333.333333333332)

+ Write a query to get the job ID and maximum salary of the employees where maximum salary is greater than or equal to $4000.

In [46]:
query_40 = '''
SELECT  job_id, MAX(salary)
FROM employees
GROUP BY job_id
HAVING MAX(salary)>= 4000
'''
    
cur.execute(query_40)
for c in cur.fetchall():
    print(c)

('AC_ACCOUNT', 8300)
('AC_MGR', 12000)
('AD_ASST', 4400)
('AD_PRES', 24000)
('AD_VP', 17000)
('FI_ACCOUNT', 9000)
('FI_MGR', 12000)
('HR_REP', 6500)
('IT_PROG', 9000)
('MK_MAN', 13000)
('MK_REP', 6000)
('PR_REP', 10000)
('PU_MAN', 11000)
('SA_MAN', 14000)
('SA_REP', 11500)
('SH_CLERK', 4200)
('ST_MAN', 8200)

+ Write a query to get the average salary for all departments employing more than 10 employees.

In [47]:
query_41 = '''
SELECT  AVG(salary), COUNT (department_id)
FROM employees
GROUP BY department_id
HAVING COUNT (department_id) >= 10
'''
    
cur.execute(query_41)
for c in cur.fetchall():
    print(c)

(3475.5555555555557, 45)
(8955.882352941177, 34)

+ Write a query to find the names (first_name, last_name) and salaries of the employees who have a higher salary than the employee whose last_name='Bull'.

In [48]:
query_42 = '''
SELECT  first_name, last_name, salary
FROM employees
WHERE salary > 
(SELECT salary 
FROM employees
WHERE last_name = "Bull")
'''
    
cur.execute(query_42)
for c in cur.fetchmany(10):
    print(c)

('Steven', 'King', 24000)
('Neena', 'Kochhar', 17000)
('Lex', 'De Haan', 17000)
('Alexander', 'Hunold', 9000)
('Bruce', 'Ernst', 6000)
('David', 'Austin', 4800)
('Valli', 'Pataballa', 4800)
('Diana', 'Lorentz', 4200)
('Nancy', 'Greenberg', 12000)
('Daniel', 'Faviet', 9000)

+ Write a query to find the names (first_name, last_name) of all employees who works in the IT department.

In [49]:
query_43 = '''
SELECT first_name, last_name 
FROM employees
WHERE department_id = 
(SELECT department_id
FROM departments
WHERE depart_name = "IT")
'''
    
cur.execute(query_43)
for c in cur.fetchmany(10):
    print(c)

('Alexander', 'Hunold')
('Bruce', 'Ernst')
('David', 'Austin')
('Valli', 'Pataballa')
('Diana', 'Lorentz')

+ Write a query to find the names (first_name, last_name) of the employees who have a manager who works for a department based in the United States. Hint : Write single-row and multiple-row subqueries

In [50]:
query_44 = '''
SELECT first_name, last_name
FROM employees
WHERE manager_id IN 
(SELECT manager_id
FROM departments
WHERE location_id IN 
(SELECT location_id
FROM locations
WHERE country_id =
(SELECT country_id
FROM countries
WHERE country_name LIKE '%United States%')
))
'''
    
cur.execute(query_44)
for c in cur.fetchmany(10):
    print(c)

('Neena', 'Kochhar')
('Lex', 'De Haan')
('Bruce', 'Ernst')
('David', 'Austin')
('Valli', 'Pataballa')
('Diana', 'Lorentz')
('Daniel', 'Faviet')
('John', 'Chen')
('Ismael', 'Sciarra')
('Jose Manuel', 'Urman')

+ Write a query to find the names (first_name, last_name) of the employees who are managers.

In [51]:
query_45 = '''
SELECT first_name, last_name
FROM employees
WHERE employee_id IN 
(SELECT manager_id
FROM employees)
'''
    
cur.execute(query_45)
for c in cur.fetchall():
    print(c)

('Steven', 'King')
('Neena', 'Kochhar')
('Lex', 'De Haan')
('Alexander', 'Hunold')
('Nancy', 'Greenberg')
('Den', 'Raphaely')
('Matthew', 'Weiss')
('Adam', 'Fripp')
('Payam', 'Kaufling')
('Shanta', 'Vollman')
('Kevin', 'Mourgos')
('John', 'Russell')
('Karen', 'Partners')
('Alberto', 'Errazuriz')
('Gerald', 'Cambrault')
('Eleni', 'Zlotkey')
('Michael', 'Hartstein')
('Shelley', 'Higgins')

+ Write a query to find the names (first_name, last_name), the salary of the employees whose salary is greater than the average salary.

In [52]:
query_46 = '''
SELECT first_name, last_name, salary
FROM employees
WHERE salary > 
(SELECT AVG(salary)
FROM employees)
'''
    
cur.execute(query_46)
for c in cur.fetchmany(10):
    print(c)

('Steven', 'King', 24000)
('Neena', 'Kochhar', 17000)
('Lex', 'De Haan', 17000)
('Alexander', 'Hunold', 9000)
('Nancy', 'Greenberg', 12000)
('Daniel', 'Faviet', 9000)
('John', 'Chen', 8200)
('Ismael', 'Sciarra', 7700)
('Jose Manuel', 'Urman', 7800)
('Luis', 'Popp', 6900)

+ Write a query to find the names (first_name, last_name), the salary of the employees whose salary is equal to the minimum salary for their job grade.

In [53]:
query_47 = '''
SELECT first_name, last_name, salary
FROM employees AS e
INNER JOIN jobs AS j on j.job_id = e.job_id
WHERE e.salary = j.min_salary
'''
    
cur.execute(query_47)
for c in cur.fetchmany(10):
    print(c)

('Karen', 'Colmenares', 2500)
('Martha', 'Sullivan', 2500)
('Randall', 'Perkins', 2500)

+ Write a query to find the names (first_name, last_name), the salary of the employees who earn more than the average salary and who works in any of the IT departments.

In [54]:
query_48 = '''
SELECT first_name, last_name, salary
FROM employees 
WHERE salary > 
(SELECT AVG(salary)
FROM employees
) AND (department_id IN
(SELECT department_id
FROM departments
WHERE depart_name LIKE "%IT%"))
'''
    
cur.execute(query_48)
for c in cur.fetchmany(10):
    print(c)

('Alexander', 'Hunold', 9000)

+ Write a query to find the names (first_name, last_name), the salary of the employees who earn more than Mr. Bell.

In [55]:
query_49 = '''
SELECT first_name, last_name, salary
FROM employees 
WHERE salary >
(SELECT salary
FROM employees
WHERE last_name = 'Bell')
'''
    
cur.execute(query_49)
for c in cur.fetchmany(10):
    print(c)

('Steven', 'King', 24000)
('Neena', 'Kochhar', 17000)
('Lex', 'De Haan', 17000)
('Alexander', 'Hunold', 9000)
('Bruce', 'Ernst', 6000)
('David', 'Austin', 4800)
('Valli', 'Pataballa', 4800)
('Diana', 'Lorentz', 4200)
('Nancy', 'Greenberg', 12000)
('Daniel', 'Faviet', 9000)

+ Write a query to find the names (first_name, last_name), the salary of the employees who earn the same salary as the minimum salary for all departments.

In [56]:
query_50 = '''
SELECT first_name, last_name, salary
FROM employees 
WHERE salary = 
(SELECT MIN(salary)
FROM employees)
'''
    
cur.execute(query_50)
for c in cur.fetchmany(10):
    print(c)

('TJ', 'Olson', 2100)

+ Write a query to find the names (first_name, last_name) of the employees who are not supervisors.

In [57]:
query_51 = '''
SELECT first_name, last_name
FROM employees 
WHERE employee_id NOT IN  
(SELECT manager_id
FROM employees)
'''
    
cur.execute(query_51)
for c in cur.fetchmany(10):
    print(c)

('Bruce', 'Ernst')
('David', 'Austin')
('Valli', 'Pataballa')
('Diana', 'Lorentz')
('Daniel', 'Faviet')
('John', 'Chen')
('Ismael', 'Sciarra')
('Jose Manuel', 'Urman')
('Luis', 'Popp')
('Alexander', 'Khoo')

+ Write a query to display the employee ID, first name, last names, salary of all employees whose salary is above average for their departments.

In [58]:
query_52 = '''
SELECT department_id, employee_id, first_name, last_name, salary
FROM employees 
GROUP BY department_id
HAVING salary > AVG (salary)
'''
    
cur.execute(query_52)
for c in cur.fetchall():
    print(c)

(20, 201, 'Michael', 'Hartstein', 13000)
(30, 114, 'Den', 'Raphaely', 11000)
(50, 120, 'Matthew', 'Weiss', 8000)
(60, 103, 'Alexander', 'Hunold', 9000)
(80, 145, 'John', 'Russell', 14000)
(90, 100, 'Steven', 'King', 24000)
(100, 108, 'Nancy', 'Greenberg', 12000)
(110, 205, 'Shelley', 'Higgins', 12000)

+ Write a query to find the 5th maximum salary in the employees table.

In [59]:
query_53 = '''
SELECT salary
FROM employees 
ORDER BY salary DESC
LIMIT 1 OFFSET 4
'''
    
cur.execute(query_53)
for c in cur.fetchall():
    print(c)

(13500,)

+ Write a query to find the 4th minimum salary in the employees table.

In [60]:
query_54 = '''
SELECT salary
FROM employees 
ORDER BY salary ASC
LIMIT 1 OFFSET 3
'''
    
cur.execute(query_54)
for c in cur.fetchall():
    print(c)

(2400,)

+ Write a query to select last 10 records from a table.

In [61]:
query_55 = '''
SELECT *
FROM employees 
ORDER BY rowid DESC
LIMIT 10
'''
    
cur.execute(query_55)
for c in cur.fetchall():
    print(c)

(206, 'William', 'Gietz', 'WGIETZ', '515.123.8181', '1987-10-01', 'AC_ACCOUNT', 8300, 1, 205, 110, None)
(205, 'Shelley', 'Higgins', 'SHIGGINS', '515.123.8080', '1987-09-30', 'AC_MGR', 12000, 1, 101, 110, None)
(204, 'Hermann', 'Baer', 'HBAER', '515.123.8888', '1987-09-29', 'PR_REP', 10000, 0, 101, 70, None)
(203, 'Susan', 'Mavris', 'SMAVRIS', '515.123.7777', '1987-09-28', 'HR_REP', 6500, 0, 101, 40, None)
(202, 'Pat', 'Fay', 'PFAY', '603.123.6666', '1987-09-27', 'MK_REP', 6000, 0, 201, 20, None)
(201, 'Michael', 'Hartstein', 'MHARTSTE', '515.123.5555', '1987-09-26', 'MK_MAN', 13000, 0, 100, 20, None)
(200, 'Jennifer', 'Whalen', 'JWHALEN', '515.123.4444', '1987-09-25', 'AD_ASST', 4400, 0, 101, 10, None)
(199, 'Douglas', 'Grant', 'DGRANT', '650.507.9844', '1987-09-24', 'SH_CLERK', 2600, 0, 124, 50, None)
(198, 'Donald', 'OConnell', 'DOCONNEL', '650.507.9833', '1987-09-23', 'SH_CLERK', 2600, 0, 124, 50, None)
(197, 'Kevin', 'Feeney', 'KFEENEY', '650.507.9822', '1987-09-22', 'SH_CLERK', 3000, 0, 124, 50, None)

+ Write a query to list department number, name for all the departments in which there are no employees in the department.

In [62]:
query_56 = '''
SELECT department_id, depart_name
FROM departments AS d
GROUP BY department_id
HAVING 
(SELECT COUNT(employee_id)
FROM employees AS e
WHERE d.department_id = e.department_id) = 0
'''
    
cur.execute(query_56)
for c in cur.fetchall():
    print(c)

(120, 'Treasury')
(130, 'Corporate Tax')
(140, 'Control And Credit')
(150, 'Shareholder Services')
(160, 'Benefits')
(170, 'Manufacturing')
(180, 'Construction')
(190, 'Contracting')
(200, 'Operations')
(210, 'IT Support')
(220, 'NOC')
(230, 'IT Helpdesk')
(240, 'Government Sales')
(250, 'Retail Sales')
(260, 'Recruiting')
(270, 'Payroll')

+ Write a query to find the addresses (location_id, street_address, city, state_province, country_name) of all the departments.

In [63]:
query_57 = '''
SELECT l.location_id, street_address, city, state_province, c.country_name
FROM locations AS l
INNER JOIN departments AS d on d.location_id = l.location_id
INNER JOIN countries AS c on c.country_id = l.country_id
'''
    
cur.execute(query_57)
for c in cur.fetchmany(10):
    print(c)

(1700, '2004 Charade Rd', 'Seattle', 'Washington', 'United States of America')
(1800, '147 Spadina Ave', 'Toronto', 'Ontario', 'Canada')
(1700, '2004 Charade Rd', 'Seattle', 'Washington', 'United States of America')
(2400, '8204 Arthur St', 'London', '', 'United Kingdom')
(1500, '2011 Interiors Blvd', 'South San Francisco', 'California', 'United States of America')
(1400, '2014 Jabberwocky Rd', 'Southlake', 'Texas', 'United States of America')
(2700, 'Schwanthalerstr. 7031', 'Munich', 'Bavaria', 'Germany')
(2500, 'Magdalen Centre, The Oxford Science Park', 'Oxford', 'Oxford', 'United Kingdom')
(1700, '2004 Charade Rd', 'Seattle', 'Washington', 'United States of America')
(1700, '2004 Charade Rd', 'Seattle', 'Washington', 'United States of America')

+ Write a query to find the names (first_name, last name), department ID and the name of all the employees.

In [64]:
query_58 = '''
SELECT first_name, last_name, department_id
FROM employees
'''
    
cur.execute(query_58)
for c in cur.fetchmany(10):
    print(c)

('Steven', 'King', 90)
('Neena', 'Kochhar', 90)
('Lex', 'De Haan', 90)
('Alexander', 'Hunold', 60)
('Bruce', 'Ernst', 60)
('David', 'Austin', 60)
('Valli', 'Pataballa', 60)
('Diana', 'Lorentz', 60)
('Nancy', 'Greenberg', 100)
('Daniel', 'Faviet', 100)

+ Write a query to find the employee id, name (last_name) along with their manager_id, manager name (last_name).

In [65]:
query_59 = '''
SELECT e.employee_id, e.last_name, e.manager_id, m.last_name
FROM employees AS e
INNER JOIN employees AS m on (e.manager_id = m.employee_id)
'''
    
cur.execute(query_59)
for c in cur.fetchmany(10):
    print(c)

(101, 'Kochhar', 100, 'King')
(102, 'De Haan', 100, 'King')
(103, 'Hunold', 102, 'De Haan')
(104, 'Ernst', 103, 'Hunold')
(105, 'Austin', 103, 'Hunold')
(106, 'Pataballa', 103, 'Hunold')
(107, 'Lorentz', 103, 'Hunold')
(108, 'Greenberg', 101, 'Kochhar')
(109, 'Faviet', 108, 'Greenberg')
(110, 'Chen', 108, 'Greenberg')

+ Write a query to find the names (first_name, last_name) and hire date of the employees who were hired after 'Jones'.

In [66]:
query_60 = '''
SELECT first_name, last_name, hire_date
FROM employees 
WHERE hire_date > 
(SELECT hire_date
FROM employees
WHERE last_name LIKE '%Jones%')
'''
    
cur.execute(query_60)
for c in cur.fetchmany(10):
    print(c)

('Alana', 'Walsh', '1987-09-21')
('Kevin', 'Feeney', '1987-09-22')
('Donald', 'OConnell', '1987-09-23')
('Douglas', 'Grant', '1987-09-24')
('Jennifer', 'Whalen', '1987-09-25')
('Michael', 'Hartstein', '1987-09-26')
('Pat', 'Fay', '1987-09-27')
('Susan', 'Mavris', '1987-09-28')
('Hermann', 'Baer', '1987-09-29')
('Shelley', 'Higgins', '1987-09-30')

+ Write a query to get the department name and number of employees in the department.

In [67]:
query_61 = '''
SELECT d.depart_name, COUNT (e.department_id)
FROM employees AS e
INNER JOIN departments AS d ON (d.department_id = e.department_id)
GROUP BY e.department_id
'''
    
cur.execute(query_61)
for c in cur.fetchall():
    print(c)

('Administration', 1)
('Marketing', 2)
('Purchasing', 6)
('Human Resources', 1)
('Shipping', 45)
('IT', 5)
('Public Relations', 1)
('Sales', 34)
('Executive', 3)
('Finance', 6)
('Accounting', 2)

+ Write a query to find the employee ID, job title number of days between ending date and starting date for all jobs in department 90 from job history.

In [68]:
query_62 = '''
SELECT jh.employee_id, j.job_title, (JULIANDAY (jh.end_date) - JULIANDAY (jh.start_date)) AS 'days'
FROM job_history AS jh
INNER JOIN jobs AS j ON jh.job_id = j.job_id
WHERE jh.department_id = 90
'''
    
cur.execute(query_62)
for c in cur.fetchmany(10):
    print(c)

(200, 'Administration Assistant', 2100.0)
(200, 'Public Accountant', 1644.0)

+ Write a query to display the department ID, department name, and manager first name.

In [69]:
query_63 = '''
SELECT d.department_id, depart_name, e.first_name
FROM departments AS d
INNER JOIN employees AS e ON (d.manager_id = e.employee_id)
'''
    
cur.execute(query_63)
for c in cur.fetchmany(10):
    print(c)

(10, 'Administration', 'Jennifer')
(20, 'Marketing', 'Michael')
(30, 'Purchasing', 'Den')
(40, 'Human Resources', 'Susan')
(50, 'Shipping', 'Adam')
(60, 'IT', 'Alexander')
(70, 'Public Relations', 'Hermann')
(80, 'Sales', 'John')
(90, 'Executive', 'Steven')
(100, 'Finance', 'Nancy')

+ Write a query to display the department name, manager name, and city.

In [70]:
query_64 = '''
SELECT d.depart_name, e.first_name, l.city
FROM departments AS d
INNER JOIN employees AS e ON (d.manager_id = e.employee_id)
INNER JOIN locations AS l ON (d.location_id = l.location_id)
'''
    
cur.execute(query_64)
for c in cur.fetchmany(10):
    print(c)

('Administration', 'Jennifer', 'Seattle')
('Marketing', 'Michael', 'Toronto')
('Purchasing', 'Den', 'Seattle')
('Human Resources', 'Susan', 'London')
('Shipping', 'Adam', 'South San Francisco')
('IT', 'Alexander', 'Southlake')
('Public Relations', 'Hermann', 'Munich')
('Sales', 'John', 'Oxford')
('Executive', 'Steven', 'Seattle')
('Finance', 'Nancy', 'Seattle')

+ Write a query to display the job title and average salary of employees.

In [71]:
query_65 = '''
SELECT job_title, (max_salary-min_salary) as 'Average Salary'
FROM jobs
GROUP BY job_title
'''
    
cur.execute(query_65)
for c in cur.fetchmany(10):
    print(c)

('Accountant', 4800)
('Accounting Manager', 7800)
('Administration Assistant', 3000)
('Administration Vice President', 15000)
('Finance Manager', 7800)
('Human Resources Representative', 5000)
('Marketing Manager', 6000)
('Marketing Representative', 5000)
('President', 20000)
('Programmer', 6000)

+ Write a query to to display job title, employee name, and the difference between the salary of the employee and minimum salary for the job.

In [72]:
query_66 = '''
SELECT j.job_title, e.first_name, e.salary - j.min_salary
FROM employees AS e
INNER JOIN jobs AS j ON (e.job_id=j.job_id)
'''
    
cur.execute(query_66)
for c in cur.fetchmany(10):
    print(c)

('President', 'Steven', 4000)
('Administration Vice President', 'Neena', 2000)
('Administration Vice President', 'Lex', 2000)
('Programmer', 'Alexander', 5000)
('Programmer', 'Bruce', 2000)
('Programmer', 'David', 800)
('Programmer', 'Valli', 800)
('Programmer', 'Diana', 200)
('Finance Manager', 'Nancy', 3800)
('Accountant', 'Daniel', 4800)

+ Write a query to display the job history that was done by any employee who is currently drawing more than 10000 of salary.

In [73]:
query_67 = '''
SELECT jh.*
FROM job_history as jh
INNER JOIN employees AS e ON (e.employee_id=jh.employee_id)
WHERE e.salary > 10000
'''
    
cur.execute(query_67)
for c in cur.fetchmany(10):
    print(c)

(102, '1993-01-13', '1998-07-24', 'IT_PROG', 60)
(101, '1989-09-21', '1993-10-27', 'AC_ACCOUNT', 110)
(101, '1993-10-28', '1997-03-15', 'AC_MGR', 110)
(201, '1996-02-17', '1999-12-19', 'MK_REP', 20)
(114, '1998-03-24', '1999-12-31', 'ST_CLERK', 50)